Repository: czhovo/chekinana
Catalog: ios/Chekinana/Chekinana/Localizable.xcstrings
Source language: en
Languages: ja, zh_hans, zh_hant

# import.error.idols
source: Too many Idols.
ja: アイドルが多すぎます。
zh_hans: 偶像数量过多。
zh_hant: 偶像數量過多。

# import.error.integer
source: Backup contains an invalid number.
ja: バックアップに無効な数値があります。
zh_hans: 备份包含无效数值。
zh_hant: 備份包含無效數值。

# import.error.integer_range
source: A backup number is outside its allowed range.
ja: バックアップの数値が許容範囲外です。
zh_hans: 备份数值超出允许范围。
zh_hant: 備份數值超出允許範圍。

# import.error.missing_idol
source: Source Idol #%lld is no longer available locally.
ja: 元アイドル#%lldはローカルに存在しません。
zh_hans: 来源偶像#%lld已不在本地。
zh_hant: 來源偶像 #%lld 已不在本機。

# import.error.multiple_relationships
source: This import would add multiple %1$@ records for one Idol, which cannot be stored safely yet. No records were imported.
ja: このインポートでは、1人のアイドルに複数の%1$@レコードを追加する必要がありますが、現在は安全に保存できません。レコードはインポートされませんでした。
zh_hans: 此次导入需要为同一偶像添加多条%1$@记录，当前无法安全存储。未导入任何记录。
zh_hant: 本次匯入需要為同一位偶像新增多筆 %1$@ 記錄，目前無法安全儲存。未匯入任何記錄。

# import.error.name
source: Every Idol needs a name.
ja: すべてのアイドルに名前が必要です。
zh_hans: 每个偶像都需要名称。
zh_hant: 每位偶像都需要名稱。

# import.error.not_zip
source: The selected file is not a valid ZIP-based ChekiRoku backup.
ja: 選択したファイルは有効なZIP形式のChekiRokuバックアップではありません。
zh_hans: 所选文件不是有效的 ChekiRoku ZIP 格式备份。
zh_hant: 所選檔案不是有效的 ChekiRoku ZIP 格式備份。

# import.error.objects
source: Too many target objects.
ja: 追加対象が多すぎます。
zh_hans: 待添加对象数量过多。
zh_hant: 待新增的項目過多。

# import.error.records
source: Too many records.
ja: 記録が多すぎます。
zh_hans: 记录数量过多。
zh_hant: 記錄數量過多。

# import.error.required_table
source: A required backup object is not an ordinary table.
ja: 必要なバックアップ項目が通常のテーブルではありません。
zh_hans: 必要的备份对象不是普通数据表。
zh_hant: 必要的備份物件不是一般資料表。

# import.error.text
source: Backup contains invalid text.
ja: バックアップに無効なテキストがあります。
zh_hans: 备份包含无效文本。
zh_hant: 備份包含無效文字。

# import.error.text_length
source: Backup text exceeds its allowed length.
ja: バックアップのテキストが長すぎます。
zh_hans: 备份文本超过允许长度。
zh_hant: 備份文字超過允許長度。

# import.error.unmapped_record
source: A source record has no resolved Idol mapping.
ja: アイドルとの対応がない元記録があります。
zh_hans: 有来源记录未解析到偶像映射。
zh_hant: 有來源記錄尚未確定對應的偶像。

# import.error.unreadable
source: The selected ChekiRoku backup could not be read.
ja: ChekiRokuバックアップを読み込めません。
zh_hans: 无法读取所选 ChekiRoku 备份。
zh_hant: 無法讀取所選的 ChekiRoku 備份。

# import.error.unresolved_member
source: Source Idol #%lld still needs a match choice.
ja: 元アイドル#%lldの一致先を選択してください。
zh_hans: 来源偶像#%lld仍需选择匹配项。
zh_hant: 來源偶像 #%lld 仍需選擇對應項目。

# import.error.version
source: Unsupported ChekiRoku backup version.
ja: 対応していないChekiRokuバックアップです。
zh_hans: 不支持此 ChekiRoku 备份版本。
zh_hant: 不支援此 ChekiRoku 備份版本。

# import.error.zip
source: Invalid ZIP.
ja: ZIPが無効です。
zh_hans: ZIP 无效。
zh_hant: ZIP 無效。

# import.error.zip_compressed
source: Invalid compressed ZIP data.
ja: 圧縮ZIPデータが無効です。
zh_hans: ZIP 压缩数据无效。
zh_hant: ZIP 壓縮資料無效。

# import.error.zip_directory
source: ZIP directory missing.
ja: ZIPディレクトリがありません。
zh_hans: ZIP 中央目录缺失。
zh_hant: 缺少 ZIP 中央目錄。

# import.error.zip_duplicate
source: Duplicate ZIP entry.
ja: ZIP項目が重複しています。
zh_hans: ZIP 条目重复。
zh_hant: ZIP 項目重複。

# import.error.zip_entry
source: Invalid ZIP entry.
ja: ZIP項目が無効です。
zh_hans: ZIP 条目无效。
zh_hant: ZIP 項目無效。

# import.error.zip_expansion
source: ZIP expansion limit exceeded.
ja: ZIPの展開制限を超えています。
zh_hans: ZIP 解压超过限制。
zh_hant: ZIP 解壓縮超過限制。

# import.error.zip_header
source: Invalid ZIP local header.
ja: ZIPローカルヘッダーが無効です。
zh_hans: ZIP 本地头无效。
zh_hant: ZIP 本機檔案標頭無效。

# import.error.zip_integrity
source: ZIP integrity check failed.
ja: ZIPの整合性確認に失敗しました。
zh_hans: ZIP 完整性检查失败。
zh_hant: ZIP 完整性檢查失敗。

# import.error.zip_limits
source: ZIP limits exceeded.
ja: ZIPの制限を超えています。
zh_hans: ZIP 超出限制。
zh_hant: ZIP 超出限制。

# import.error.zip_mismatch
source: ZIP entry mismatch.
ja: ZIP項目が一致しません。
zh_hans: ZIP 条目不匹配。
zh_hant: ZIP 項目不符。

# import.error.zip_path
source: Unsafe ZIP path.
ja: 安全でないZIPパスです。
zh_hans: ZIP 路径不安全。
zh_hant: ZIP 路徑不安全。

# import.error.zip_unsafe
source: Unsafe ZIP entry.
ja: 安全でないZIP項目です。
zh_hans: ZIP 条目不安全。
zh_hant: ZIP 項目不安全。

# import.error.zip_variant
source: Multipart or Zip64 archives are not supported.
ja: 分割ZIPとZip64には対応していません。
zh_hans: 不支持分卷备份或 Zip64 备份。
zh_hant: 不支援分割備份或 Zip64 備份。

# import.existing_skip
source: Existing Idol — will skip
ja: 既存のアイドル：スキップ
zh_hans: 本地已有偶像——将跳过
zh_hant: 本機已有偶像，將略過

# import.export_steps
source: ChekiRoku → Settings → Backup & Restore → Local Backup → Save to Files
ja: チェキロク → 設定 → バックアップと復元 → ローカルバックアップ → “ファイル”に保存
zh_hans: ChekiRoku → 设置 → 备份与还原 → 本地备份 → 存储到“文件”
zh_hant: ChekiRoku → 設定 → 備份與還原 → 本機備份 → 儲存到「檔案」

# import.group
source: Group
ja: グループ
zh_hans: 团体
zh_hant: 團體

# import.imported
source: Imported %lld missing records.
ja: 不足していた%lld件をインポートしました。
zh_hans: 已导入%lld条缺少的记录。
zh_hant: 已匯入 %lld 筆缺少的記錄。

# import.imported.one
source: Imported %lld missing record.
ja: 不足していた記録を%lld件インポートしました。
zh_hans: 已导入%lld条缺少的记录。
zh_hant: 已匯入 %lld 筆缺少的記錄。

# import.imported.other
source: Imported %lld missing records.
ja: 不足していた記録を%lld件インポートしました。
zh_hans: 已导入%lld条缺少的记录。
zh_hant: 已匯入 %lld 筆缺少的記錄。

# import.include_member
source: Include source Idol #%lld
ja: 元アイドル#%lldを含める
zh_hans: 包含来源偶像#%lld
zh_hant: 包含來源偶像 #%lld

# import.intro
source: Browse Files and select one .chekiroku backup.
ja: ファイルを参照して.chekirokuバックアップを1つ選択します。
zh_hans: 浏览“文件”并选择一个 .chekiroku 备份。
zh_hant: 瀏覽「檔案」並選擇一個 .chekiroku 備份。

# import.match_required
source: Choose Create New or an existing local Idol.
ja: 新規作成または既存のローカルアイドルを選択してください。
zh_hans: 请选择新建或一个本地已有偶像。
zh_hant: 請選擇新增或一位本機已有的偶像。

# import.member_excluded
source: Not selected — this Idol and its records will be excluded.
ja: 未選択：このアイドルと記録は除外されます。
zh_hans: 未选择——该偶像及其记录将被排除。
zh_hant: 未選取，此偶像及其記錄將被排除。

# import.name
source: Name
ja: 名前
zh_hans: 名称
zh_hant: 名稱

# import.new_create
source: New Idol — will create
ja: 新しいアイドル：作成予定
zh_hans: 新偶像——将创建
zh_hant: 新偶像，將建立

# import.no_group
source: No group
ja: グループなし
zh_hans: 无团体
zh_hant: 無團體

# import.only_missing
source: Only missing quantities are added. Existing records count whether or not they have media.
ja: 不足分のみ追加します。メディアの有無にかかわらず既存記録を数えます。
zh_hans: 仅补充不足数量；本地记录无论是否包含媒体都会计数。
zh_hant: 僅補足缺少的數量；本機記錄無論是否包含媒體都會計入。

# import.progress.idol
source: Adding Idol %lld/%lld
ja: アイドルを追加中%lld/%lld
zh_hans: 正在添加偶像%lld/%lld
zh_hant: 正在新增偶像 %lld/%lld

# import.progress.idol_name
source: Adding Idol %1$lld/%2$lld · %3$@
ja: アイドルを追加中%1$lld/%2$lld · %3$@
zh_hans: 正在添加偶像%1$lld/%2$lld · %3$@
zh_hant: 正在新增偶像 %1$lld/%2$lld · %3$@

# import.progress.records
source: Adding records · %1$@ · %2$lld/%3$lld
ja: 記録を追加中 · %1$@ · %2$lld/%3$lld
zh_hans: 正在添加记录 · %1$@ · %2$lld/%3$lld
zh_hant: 正在新增記錄 · %1$@ · %2$lld/%3$lld

# import.record_summary
source: Source rows: %1$lld · Records to add: %2$lld
ja: 元データ：%1$lld行 · 追加記録：%2$lld件
zh_hans: 来源数据：%1$lld条 · 将添加记录：%2$lld条
zh_hant: 來源資料：%1$lld 筆 · 將新增記錄：%2$lld 筆

# import.records.ignore_notes
source: Ignore notes
ja: メモを無視
zh_hans: 忽略备注
zh_hant: 忽略備註

# import.records.row_quantity
source: Source quantity: %1$lld · To add: %2$lld
ja: 元の枚数：%1$lld · 追加：%2$lld
zh_hans: 原数量：%1$lld · 待添加：%2$lld
zh_hant: 原數量：%1$lld · 待新增：%2$lld

# import.review
source: Review the local Idol matches. New Idols use a unique name-and-group catalogue match, or the backup profile if the search fails.
ja: ローカルのアイドルとの対応を確認してください。新規作成時は名前とグループが一致する唯一の検索結果を使用し、検索できない場合はバックアップの情報を使用します。
zh_hans: 请核对本地 Idol 的对应关系。新建时使用姓名和组合唯一匹配的资料库结果；搜索失败则使用备份资料。
zh_hant: 請核對本機 Idol 的對應關係。新建時使用姓名和團體唯一匹配的資料庫結果；搜尋失敗則使用備份資料。

# import.select_all
source: Select All
ja: すべて選択
zh_hans: 全选
zh_hant: 全選

# import.selected_count
source: Selected %1$lld of %2$lld
ja: %2$lld人中%1$lld人を選択
zh_hans: 已选择%1$lld/%2$lld
zh_hant: 已選取 %1$lld/%2$lld

# import.source_idol
source: Source Idol #%lld
ja: 元アイドル#%lld
zh_hans: 来源偶像#%lld
zh_hant: 來源偶像 #%lld

# import.source_name_required
source: Source Idol #%lld: enter a name to import its records.
ja: 元アイドル#%lld：記録をインポートするには名前を入力してください。
zh_hans: 来源偶像#%lld：请输入名称以导入记录。
zh_hant: 來源偶像 #%lld：請輸入名稱以匯入記錄。

# import.stage.adding_records
source: Adding records…
ja: 記録を追加中…
zh_hans: 正在添加记录…
zh_hant: 正在新增記錄…

# import.stage.matching
source: Matching Idols
ja: アイドルを照合中
zh_hans: 正在匹配偶像
zh_hant: 正在比對偶像

# import.stage.parsing
source: Parsing archive
ja: アーカイブを解析中
zh_hans: 正在解析备份
zh_hant: 正在解析備份

# import.stage.planning
source: Planning records
ja: 記録を準備中
zh_hans: 正在规划记录
zh_hant: 正在規劃記錄

# import.stage.reading
source: Reading selected file
ja: 選択したファイルを読み込み中
zh_hans: 正在读取所选文件
zh_hant: 正在讀取所選檔案

# import.step1
source: Step 1 of 2 · Add Idols
ja: ステップ1/2 · アイドルを追加
zh_hans: 第1/2步 · 添加偶像
zh_hant: 第 1/2 步 · 新增偶像

# import.step2
source: Step 2 of 2 · Add Records
ja: ステップ2/2 · 記録を追加
zh_hans: 第2/2步 · 添加记录
zh_hant: 第 2/2 步 · 新增記錄

# import.title
source: Import from ChekiRoku
ja: チェキロクからインポート
zh_hans: 从 ChekiRoku 导入
zh_hant: 從 ChekiRoku 匯入

# import.use_local
source: Use local Idol
ja: ローカルアイドルを使用
zh_hans: 使用本地偶像
zh_hant: 使用本機偶像

source: Include date
ja: 日付を含める
zh_hans: 包含日期
zh_hant: 包含日期

source: Index (optional)
ja: 番号（任意）
zh_hans: 编号（可选）
zh_hant: 編號（選填）

source: Input photos
ja: 入力写真
zh_hans: 输入照片
zh_hant: 輸入照片

source: invalid argument: %@
ja: 引数が無効です：%@
zh_hans: 参数无效：%@
zh_hant: 參數無效：%@

# listcheki 只接受 idol/event/date 字段
source: listcheki accepts only idol/event/date fields.
ja: listchekiが受け付けるのはidol/event/dateのフィールドのみです。
zh_hans: listcheki 只接受 idol/event/date 字段。
zh_hant: listcheki 只接受 idol/event/date 欄位。

source: Loaded
ja: 読み込み済み
zh_hans: 已载入
zh_hant: 已載入

source: Long press and drag to reorder within the favorite group.
ja: 長押ししてドラッグすると、お気に入りグループ内で並べ替えられます。
zh_hans: 长按并拖动可在收藏组内重新排序。
zh_hant: 長按並拖移可在收藏群組內重新排序。

source: Managed file cleanup remains queued.
ja: 管理対象ファイルのクリーンアップは待機中です。
zh_hans: 托管文件清理仍在队列中。
zh_hant: 受管理檔案的清理仍在佇列中。

source: Manual
ja: 手動
zh_hans: 手动
zh_hant: 手動

# match_game.audio_error.cannot_play
source: Local audio could not be played.
ja: ローカル音声を再生できません。
zh_hans: 本地音频无法播放
zh_hant: 無法播放本機音訊。

# match_game.audio_error.unavailable
source: Local audio is unavailable.
ja: ローカル音声を利用できません。
zh_hans: 本地音频不可用
zh_hant: 無法使用本機音訊。

# match_game.stat.remaining
source: Remaining
ja: 残り
zh_hans: 剩余
zh_hant: 剩餘

# match_game.stat.time
source: Time
ja: 時間
zh_hans: 时间
zh_hant: 時間

# match_game.status.answer_ended
source: The answer has ended.
ja: 解答が終了しました
zh_hans: 解答已结束
zh_hant: 解答已結束。

# match_game.status.completed
source: Complete!
ja: 完成！
zh_hans: 完成！
zh_hant: 完成！

# match_game.status.images_differ
source: The images do not match.
ja: 画像が一致しません
zh_hans: 图片不同
zh_hant: 圖片不同。

# match_game.status.invalid_path
source: No valid path connects these images.
ja: 有効な経路ではありません
zh_hans: 路径不合法
zh_hant: 沒有有效路徑可連接這兩張圖片。

# match_game.status.no_solution
source: No solution is available for the current board.
ja: 現在のボードには解がありません
zh_hans: 当前棋盘无解
zh_hant: 目前的棋盤無解。

# match_game.status.paused
source: Paused
ja: 一時停止しました
zh_hans: 已暂停
zh_hant: 已暫停

# match_game.status.solving
source: Solving…
ja: 解答中…
zh_hans: 正在求解…
zh_hant: 正在求解…

source: Media recovery is required before this item can be used or closed.
ja: この項目を使用または閉じる前に、メディアの復旧が必要です。
zh_hans: 使用或关闭此项目之前，需要先恢复媒体。
zh_hant: 使用或關閉此項目前，需要先復原媒體。

source: Media type
ja: メディア種別
zh_hans: 媒体类型
zh_hant: 媒體類型

source: Metadata
ja: メタデータ
zh_hans: 元数据
zh_hant: 中繼資料

source: Name
ja: 名前
zh_hans: 名称
zh_hant: 名稱

source: Name is required.
ja: 名前は必須です。
zh_hans: 名称不能为空。
zh_hant: 名稱不可留空。

source: No GPU is currently available. Please try again later.
ja: 現在利用可能なGPUがありません。後でもう一度お試しください。
zh_hans: 当前没有可用的 GPU。请稍后重试。
zh_hant: 目前沒有可用的 GPU。請稍後重試。

source: No local Idols
ja: ローカルのアイドルがいません
zh_hans: 没有本地偶像
zh_hant: 沒有本機偶像

source: No matches
ja: 一致する結果がありません
zh_hans: 没有匹配结果
zh_hant: 沒有符合的結果

source: No matching media
ja: 一致するメディアがありません
zh_hans: 没有匹配的媒体
zh_hant: 沒有符合的媒體

source: No patterns
ja: パターンがありません
zh_hans: 没有模式
zh_hant: 沒有模式

source: No stored pattern
ja: パターン未登録
zh_hans: 没有已存储的模式
zh_hant: 沒有已儲存的模式

source: No stored patterns
ja: 保存済みパターンなし
zh_hans: 没有已存模式
zh_hant: 沒有已儲存的模式

source: No valid 256-dimensional pattern embedding is available for the candidate Idols.
ja: 候補アイドルに有効な256次元のパターン特徴ベクトルがありません。
zh_hans: 候选偶像没有有效的256维模式嵌入向量。
zh_hant: 候選偶像沒有有效的 256 維模式嵌入向量。

source: No validated pattern resource cache is available.
ja: 検証済みのパターンリソースキャッシュがありません。
zh_hans: 没有经过验证的模式资源缓存。
zh_hant: 沒有經過驗證的模式資源快取。

source: Not selected
ja: 未選択
zh_hans: 未选择
zh_hant: 未選取

source: Note
ja: メモ
zh_hans: 备注
zh_hant: 備註

source: Open Idol details.
ja: アイドルの詳細を開きます。
zh_hans: 打开偶像详情。
zh_hant: 開啟偶像的詳細資訊。

source: Open Idol details. Use the drag handle to reorder within the favorite group.
ja: アイドルの詳細を開きます。ドラッグハンドルでお気に入りグループ内を並べ替えられます。
zh_hans: 打开偶像详情。使用拖动手柄可在收藏组内重新排序。
zh_hant: 開啟偶像的詳細資訊。使用拖移控制點可在收藏群組內重新排序。

source: Open Settings
ja: 設定を開く
zh_hans: 打开设置
zh_hant: 開啟設定

source: Other
ja: その他
zh_hans: 其他
zh_hant: 其他

source: Pattern %lld · 256D
ja: パターン%lld · 256次元
zh_hans: 模式%lld · 256维
zh_hant: 模式 %lld · 256 維

source: Pattern count
ja: パターン数
zh_hans: 模式数量
zh_hant: 模式數量

source: Pattern prototype bank failed validation.
ja: パターンのプロトタイプバンクの検証に失敗しました。
zh_hans: 模式原型库验证失败。
zh_hant: 模式原型庫驗證失敗。

source: Pattern resource manifest is incompatible with this app.
ja: パターンリソースのマニフェストはこのアプリと互換性がありません。
zh_hans: 模式资源清单与此应用不兼容。
zh_hant: 模式資源清單與此 App 不相容。

source: Pattern resources returned an invalid response.
ja: パターンリソースから無効な応答が返されました。
zh_hans: 模式资源返回了无效响应。
zh_hant: 模式資源傳回無效的回應。

source: Pattern resources returned HTTP %lld.
ja: パターンリソースがHTTP %lldを返しました。
zh_hans: 模式资源返回 HTTP %lld。
zh_hant: 模式資源傳回 HTTP %lld。

# pattern.count.one
source: %lld pattern
ja: パターン%lld件
zh_hans: %lld个模式
zh_hant: %lld 個模式

# pattern.count.other
source: %lld patterns
ja: パターン%lld件
zh_hans: %lld个模式
zh_hant: %lld 個模式

source: Pending library media recovery must finish first. %@
ja: 先に保留中のライブラリメディアの復旧を完了してください。%@
zh_hans: 请先完成待处理的资料库媒体恢复。%@
zh_hant: 請先完成待處理的資料庫媒體復原。%@

source: photo loading timed out
ja: 写真の読み込みがタイムアウトしました
zh_hans: 照片加载超时
zh_hant: 照片載入逾時

source: photo loading was cancelled
ja: 写真の読み込みをキャンセルしました
zh_hans: 照片加载已取消
zh_hant: 照片載入已取消

source: Photo preview unavailable
ja: 写真プレビューを利用できません
zh_hans: 照片预览不可用
zh_hant: 無法使用照片預覽

source: Photos access is not authorized.
ja: 「写真」へのアクセスが許可されていません。
zh_hans: 尚未授权访问相册。
zh_hant: 尚未授權存取照片。

source: Posted to SNS
ja: SNSに投稿済み
zh_hans: 已发布到社交平台
zh_hant: 已發佈至社群平台

source: Preparing media…
ja: メディアを準備中…
zh_hans: 正在准备媒体…
zh_hant: 正在準備媒體…

source: Preview
ja: プレビュー
zh_hans: 预览
zh_hant: 預覽

# product.assistant.executor.cheki.album_prepared.one
source: Prepared %lld Cheki from the photo library
ja: 写真ライブラリからチェキを%lld枚準備しました
zh_hans: 已从相册准备%lld张切
zh_hant: 已從相簿準備 %lld 張切

# product.assistant.executor.cheki.album_prepared.other
source: Prepared %lld Cheki from the photo library
ja: 写真ライブラリからチェキを%lld枚準備しました
zh_hans: 已从相册准备%lld张切
zh_hant: 已從相簿準備 %lld 張切

# product.assistant.executor.cheki.album_unreadable_suffix.one
source: ; %lld other photo could not be read
ja: 。ほかに%lld枚の写真を読み込めませんでした
zh_hans: ；另有%lld张照片无法读取
zh_hant: ；另有 %lld 張照片無法讀取

# product.assistant.executor.cheki.album_unreadable_suffix.other
source: ; %lld other photos could not be read
ja: 。ほかに%lld枚の写真を読み込めませんでした
zh_hans: ；另有%lld张照片无法读取
zh_hant: ；另有 %lld 張照片無法讀取

# product.assistant.executor.cheki.batch_already_saving
source: This temporary Cheki batch is already being saved.
ja: この一時チェキのバッチは既に保存中です。
zh_hans: 这批临时拍立得正在保存。
zh_hant: 這批暫存拍立得正在儲存。

# product.assistant.executor.cheki.deleted
source: Deleted the Cheki.
ja: チェキを削除しました。
zh_hans: 已删除拍立得。
zh_hant: 已刪除拍立得。

# product.assistant.executor.cheki.invalid_batch_confirmation
source: Invalid or duplicate Cheki confirmation.
ja: チェキの確認が無効か重複しています。
zh_hans: 拍立得确认无效或重复。
zh_hant: 拍立得確認無效或重複。

# product.assistant.executor.cheki.no_local_image
source: This Cheki has no readable local image.
ja: このチェキには読み取り可能なローカル画像がありません。
zh_hans: 这张拍立得没有可读取的本地图片。
zh_hant: 這張拍立得沒有可讀取的本機圖片。

# product.assistant.executor.cheki.none
source: No Cheki have been saved yet.
ja: 保存済みのチェキはまだありません。
zh_hans: 还没有保存的拍立得。
zh_hant: 尚未儲存任何拍立得。

# product.assistant.executor.cheki.photo_saved
source: Saved the Cheki to the photo library.
ja: チェキを写真ライブラリに保存しました。
zh_hans: 已将拍立得保存到系统相册。
zh_hant: 已將拍立得儲存至系統相簿。

# product.assistant.executor.cheki.preparation_failed
source: Cheki preparation failed: %@
ja: チェキの準備に失敗しました：%@
zh_hans: 拍立得准备失败：%@
zh_hant: 拍立得準備失敗：%@

# product.assistant.executor.cheki.prepared_delete
source: Prepared the Cheki deletion.
ja: チェキの削除を準備しました。
zh_hans: 已准备删除这张拍立得。
zh_hant: 已準備刪除這張拍立得。

# product.assistant.executor.cheki.prepared_download
source: Prepared to save the Cheki to the photo library.
ja: チェキを写真ライブラリに保存する準備ができました。
zh_hans: 已准备将拍立得保存到系统相册。
zh_hant: 已準備將拍立得儲存至系統相簿。

# product.assistant.executor.cheki.prepared_edit
source: Prepared the Cheki edit.
ja: チェキの編集を準備しました。
zh_hans: 已准备修改这张拍立得。
zh_hant: 已準備修改這張拍立得。

# product.assistant.executor.cheki.raw_scan_saved
source: Saved the original scan result without its bounding box to the photo library.
ja: 枠を付けていない元のスキャン結果を写真ライブラリに保存しました。
zh_hans: 已将未添加边框的原始扫描结果保存到系统相册。
zh_hant: 已將未加邊界框的原始掃描結果儲存至系統相簿。

# product.assistant.executor.cheki.scan_results_prepared.one
source: Prepared %lld scan result to save.
ja: %lld件のスキャン結果を保存する準備ができました。
zh_hans: 已准备保存%lld个扫描结果。
zh_hant: 已準備儲存 %lld 個掃描結果。

# product.assistant.executor.cheki.scan_results_prepared.other
source: Prepared %lld scan results to save.
ja: %lld件のスキャン結果を保存する準備ができました。
zh_hans: 已准备保存%lld个扫描结果。
zh_hant: 已準備儲存 %lld 個掃描結果。

# product.assistant.executor.cheki.temporary_changed
source: One or more temporary Cheki changed before saving.
ja: 保存前に一時チェキが変更されました。
zh_hans: 一张或多张临时拍立得在保存前发生了变化。
zh_hant: 一張或多張暫存拍立得在儲存前發生變更。

# product.assistant.executor.cheki.temporary_changed_detail
source: A temporary Cheki changed before saving.
ja: 保存前に一時チェキが変更されました。
zh_hans: 临时拍立得在保存前发生了变化。
zh_hant: 暫存拍立得在儲存前發生變更。

# product.assistant.executor.cheki.temporary_discarded_count
source: Discarded temporary Cheki: %lld.
ja: 一時チェキを%lld枚破棄しました。
zh_hans: 已丢弃%lld张临时切。
zh_hant: 已捨棄 %lld 張暫存拍立得。

# product.assistant.executor.cheki.temporary_discarded_id
source: Discarded temporary Cheki: %@.
ja: 一時チェキを破棄しました：%@。
zh_hans: 已丢弃临时拍立得：%@。
zh_hant: 已捨棄暫存拍立得：%@。

# product.assistant.executor.cheki.temporary_discarded_retained
source: Discarded temporary Cheki: %1$lld; retained %2$lld referenced by pending confirmations. Confirm or cancel those operations first.
ja: 一時チェキを%1$lld枚破棄し、確認待ちの操作が参照する%2$lld枚を保持しました。先にそれらを確認またはキャンセルしてください。
zh_hans: 已丢弃%1$lld张临时切；另有%2$lld张被待确认操作引用而保留，请先确认或取消这些操作。
zh_hant: 已捨棄 %1$lld 張暫存拍立得；另有 %2$lld 張因待確認操作參照而保留，請先確認或取消這些操作。

# product.assistant.executor.cheki.temporary_id_unsupported
source: Add Cheki no longer accepts temporary Cheki IDs. Use Add Scan Cheki for a temporary result.
ja: チェキ追加では一時チェキIDを使用できません。一時結果にはスキャンチェキ追加を使用してください。
zh_hans: 添加拍立得不再接受临时拍立得 ID；请使用添加扫描拍立得处理临时结果。
zh_hant: 新增拍立得不再接受暫存拍立得 ID；請使用新增掃描拍立得來處理暫存結果。

# product.assistant.executor.command.invalid_usage
source: Invalid usage. Usage: %@
ja: 使用方法が正しくありません。 使用方法： %@
zh_hans: 用法无效。 用法： %@
zh_hant: 用法無效。 用法： %@

# product.assistant.executor.command.not_implemented
source: Command not implemented: %1$@ Usage: %2$@
ja: 未実装のコマンド：%1$@ 使用方法： %2$@
zh_hans: 命令尚未实现：%1$@ 用法： %2$@
zh_hant: 指令尚未實作：%1$@ 用法： %2$@

# product.assistant.executor.command.unknown
source: Unknown command: %@ %@
ja: 不明なコマンド：%@ %@
zh_hans: 未知命令：%@ %@
zh_hant: 未知指令：%@ %@

# product.assistant.executor.confirmation.ambiguous_idol
source: The latest Idol search returned multiple candidates; choose one before confirming.
ja: 最新のアイドル検索に複数の候補があります。確認前に1件選択してください。
zh_hans: 最近一次偶像搜索返回了多个候选，请先选择一个再确认。
zh_hant: 最近一次偶像搜尋傳回多個候選項目，請先選擇一個再確認。

# product.assistant.executor.confirmation.cancel_recovery_pending
source: This Cheki deletion cannot be cancelled while managed image recovery or cleanup is pending. Retry Confirm.
ja: 管理画像の復元または削除処理中は、このチェキ削除をキャンセルできません。もう一度確認してください。
zh_hans: 托管图片仍在恢复或清理时不能取消本次拍立得删除，请重新确认。
zh_hant: 受管理圖片仍在復原或清理時，無法取消本次拍立得刪除，請再次確認。

# product.assistant.executor.confirmation.cancelled
source: Cancelled confirmation: %@.
ja: 確認をキャンセルしました：%@。
zh_hans: 已取消确认：%@。
zh_hant: 已取消確認：%@。

# product.assistant.executor.confirmation.cancelled_all
source: Cancelled pending confirmations: %lld.
ja: %lld件の確認待ち操作をキャンセルしました。
zh_hans: 已取消%lld个待确认操作。
zh_hant: 已取消 %lld 個待確認操作。

# product.assistant.executor.confirmation.cancelled_all_recovery
source: Cancelled pending confirmations: %1$lld; retained for required file recovery or cleanup: %2$lld. Retry Confirm to finish safely.
ja: %1$lld件をキャンセルし、ファイル復元または削除に必要な%2$lld件を保持しました。安全に完了するにはもう一度確認してください。
zh_hans: 已取消%1$lld个待确认操作；另保留%2$lld个以完成必要的文件恢复或清理，请重新确认以安全完成。
zh_hant: 已取消 %1$lld 個待確認操作；另保留 %2$lld 個以完成必要的檔案復原或清理，請再次確認以安全完成。

# product.assistant.executor.confirmation.code_format
source: Confirmation code must be 8 lowercase hexadecimal characters.
ja: 確認コードは小文字の16進数8文字である必要があります。
zh_hans: 确认码必须是8位小写十六进制字符。
zh_hant: 確認碼必須是 8 位小寫十六進位字元。

# product.assistant.executor.confirmation.expired
source: Confirmation code expired: %@.
ja: 確認コードの有効期限が切れました：%@。
zh_hans: 确认码已过期：%@。
zh_hant: 確認碼已過期：%@。

# product.assistant.executor.confirmation.failed_retained
source: Confirmation failed. This operation remains pending: %@
ja: 確認に失敗しました。この操作は確認待ちのままです：%@
zh_hans: 确认失败，该操作仍保留在待确认列表中：%@
zh_hant: 確認失敗，此操作仍保留於待確認清單中：%@

# product.assistant.executor.confirmation.invalid_or_expired
source: Invalid or expired confirmation code: %@.
ja: 確認コードが無効か期限切れです：%@。
zh_hans: 确认码无效或已过期：%@。
zh_hant: 確認碼無效或已過期：%@。

# product.assistant.executor.confirmation.none
source: There is no pending operation to confirm.
ja: 確認待ちの操作はありません。
zh_hans: 没有待确认的操作。
zh_hant: 沒有待確認的操作。

# product.assistant.executor.error.ambiguous_cheki
source: Ambiguous Cheki ID: %@.
ja: チェキIDを特定できません：%@。
zh_hans: 拍立得 ID 存在歧义：%@。
zh_hant: 無法唯一識別拍立得 ID：%@。

# product.assistant.executor.error.ambiguous_event
source: Ambiguous Event: %@. Use a longer Event ID or exact name.
ja: イベントを特定できません：%@。より長いイベントIDまたは完全な名前を使用してください。
zh_hans: 活动存在歧义：%@。请使用更长的活动 ID 或完整名称。
zh_hant: 無法唯一識別活動：%@。請使用更長的活動 ID 或完整名稱。

# product.assistant.executor.error.ambiguous_event_id
source: Ambiguous Event ID: %@.
ja: イベントIDを特定できません：%@。
zh_hans: 活动 ID 存在歧义：%@。
zh_hant: 無法唯一識別活動 ID：%@。

# product.assistant.executor.error.ambiguous_idol
source: Ambiguous Idol: %@. Use a longer Idol ID or exact name.
ja: アイドルを特定できません：%@。より長いアイドルIDまたは完全な名前を使用してください。
zh_hans: 偶像存在歧义：%@。请使用更长的偶像 ID 或完整名称。
zh_hant: 無法唯一識別偶像：%@。請使用更長的偶像 ID 或完整名稱。

# product.assistant.executor.error.ambiguous_temporary_cheki
source: Ambiguous temporary Cheki ID: %@. Use a longer ID.
ja: 一時チェキIDを特定できません：%@。より長いIDを使用してください。
zh_hans: 临时拍立得 ID 存在歧义：%@。请使用更长的 ID。
zh_hant: 無法唯一識別暫存拍立得 ID：%@。請使用更長的 ID。

# product.assistant.executor.error.avatar_reference_invalid
source: Catalogue avatar reference is invalid.
ja: カタログのアバター参照が無効です。
zh_hans: 偶像资料库头像引用无效。
zh_hant: 偶像資料庫的頭像參照無效。

# product.assistant.executor.error.avatar_unavailable
source: Catalogue avatar is temporarily unavailable.
ja: カタログのアバターは一時的に利用できません。
zh_hans: 偶像资料库头像暂时不可用。
zh_hant: 暫時無法使用偶像資料庫的頭像。

# product.assistant.executor.error.cheki_event_window
source: The Event must be dated within one day of the Cheki.
ja: イベントの日付はチェキの日付の前後1日以内である必要があります。
zh_hans: 活动日期必须在拍立得日期前后一天以内。
zh_hant: 活動日期必須在拍立得日期前後一天以內。

# product.assistant.executor.error.cheki_exists
source: Cheki already exists: %@.
ja: チェキは既に存在します：%@。
zh_hans: 拍立得已存在：%@。
zh_hant: 拍立得已存在：%@。

# product.assistant.executor.error.cheki_image_unreadable
source: Cheki image file is missing, unreadable, or not a valid image.
ja: チェキ画像が見つからない、読み取れない、または有効な画像ではありません。
zh_hans: 拍立得图片缺失、无法读取或不是有效图片。
zh_hant: 拍立得圖片遺失、無法讀取或不是有效圖片。

# product.assistant.executor.error.cheki_index_overflow
source: Cheki index cannot be incremented for this Idol/date group.
ja: このアイドル・日付グループではチェキ番号を増やせません。
zh_hans: 该偶像/日期组的拍立得编号无法继续递增。
zh_hant: 此偶像／日期群組的拍立得編號無法繼續遞增。

# product.assistant.executor.error.cheki_index_used
source: Cheki index #%lld is already used in this Idol/date group.
ja: このアイドル・日付グループではチェキ番号#%lldが既に使用されています。
zh_hans: 该偶像/日期组已使用拍立得编号#%lld。
zh_hant: 此偶像／日期群組已使用拍立得編號 #%lld。
